# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]

   # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2

  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]#2
  #- [-1, 1, FEM, [256]]

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]#4
  #- [-1, 1, FEM, [512]]

  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]#6
  #- [-1, 1, FEM, [512]]

  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]#8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]#11    b11
#  - [ -1, 1, SADN, [512]]#b12 dayuquanbu jian -1 12
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 12
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]#14
  - [-1, 1, SADN, [256]] # cat backbone P3     b15
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3 16
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small) 17

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]  #18
  #- [ -1, 1, SADN, [ 128] ]    #19
  - [ [ -1, 2 ], 1, Concat, [ 1 ] ] # cat backbone P2  19
  - [ -1, 2, C3k2, [ 128, False ] ] # 20 (P2/4-small)

  - [ -1, 1, Conv, [ 128, 3, 2 ] ]  #21
  - [ [ -1, 17 ], 1, Concat, [ 1 ] ] # cat head P3  22
  - [ -1, 2, C3k2, [ 256, False ] ] # 23 (P3/8-medium)

  - [-1, 1, Conv, [256, 3, 2]]#17   b24
  - [[-1, 13], 1,Concat, [1]] # cat head P4 18  b25
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)   b26

#  - [ -1, 1, Conv, [ 512, 3, 2 ] ]#17   b24
#  - [ [ -1, 10 ], 1,Concat, [ 1 ] ] # cat head P4 18  b25
#  - [ -1, 2, C3k2, [ 512, False ] ] # 19 (P4/16-medium)   b26



  - [[20, 23, 26 ], 1, Detect, [nc]] # Detect(P3, P4, P5)jia 29
